/***********************************************
 * Framework Name  :  Halu
 * (c) 2025 TILLS & Co.
***********************************************/
(function($, $H){
  // 名前空間を設定する
  var App = $H.Application.OrderUploadErrorList = {};

  // インスタンスプロパティを追加する
  class AppSpec extends $H.AppSpec {
   constructor(name) {
     $H.log("AppSpec init : start");
     super();
     this.name = name;
     this.nextname = "";
     this.beforename = "";

     $H.log("AppSpec init : end");
   }
 }

  // 共通モジュールを追加する
  AppSpec.include($H.Library.AppSpecMixin);

  AppSpec.include({
    // -----------------------------------------------------------------------------------------------
    // プログラム・JSONファイルのURL情報を定義する（サブシステム名・種類・Apps・プログラムフォルダ名）
    // -----------------------------------------------------------------------------------------------
    urlInfo: [
      {app:  "Sample/Html/Apps/OrderUploadErrorList/"}
     ,{json: "Sample/Json/Apps/OrderUploadErrorList/"}
    ]
    // --------------------------
    // JSONファイル情報を定義する
    // --------------------------
   ,jsonInfo: [
      {dataset:     "yes"}
     ,{validation:  "yes"}
    ]
    // ----------------------------------------------------------------------------------------
    // トランザクション・リクエストチェック・レスポンス編集・エラーのコールバック関数を定義する
    // ----------------------------------------------------------------------------------------
   ,requestInfo: [
      ["select",  "on照会OfCheckRequestData",      "on照会OfEditResponseData",      "onErrorResponseData"]
     // ここから追加処理
    ]
    // --------------------------------------------------
    // エンター・タブとPFキーのコールバック関数を定義する
    // --------------------------------------------------
   ,enterTabPFKey: {
      Enter:true
     ,Tab:true
     ,F1:"on再表示"
     ,F2:null
     ,F3:null
     ,F4:null
     ,F5:null
     ,F6:null
     ,F7:null
     ,F8:null
     ,F9:"on最初のページ"
     ,F10:"on前のページ"
     ,F11:"on次のページ"
     ,F12:"on最後のページ"
     ,ESC:"on戻る"
     ,Forms:0
    }
    // ----------------------------------------------------------------
    // イベント設定はセレクタ・イベント・コールバック関数の順に指定する
    // ----------------------------------------------------------------
    // NAVボタンのイベントを定義する
   ,navButtonEvent: [
      ["#戻る",         "click", "on戻る"]
     ,["#最初のページ", "click", "on最初のページ"]
     ,["#前のページ",   "click", "on前のページ"]
     ,["#次のページ",   "click", "on次のページ"]
     ,["#最後のページ", "click", "on最後のページ"]
     ,["#mainTable td", "click", "onテーブル行クリック"]
     // ここから追加処理
     ,["#再表示",       "click", "on再表示"]
    ]
    // バリデーションのイベントを定義する
   ,validationEvent: [
      ["#mainForm", "focus", "onFocus"]
     ,["#mainForm", "blur",  "onBlur"]
    ]
    // その他セレクターイベントを定義する
   ,selectorEvent: [
    ]
    // ----------------------------------------------------------------------------------
    // カスタムイベント設定はイベント名・実行コンテキスト・コールバック関数の順に指定する
    // ----------------------------------------------------------------------------------
    // チェック用カスタムイベントを定義する
   ,pubsubCheckEvent: [
    ]
    // 導出項目編集用カスタムイベントを定義する
   ,pubsubDeriveEvent: [
      ["deriveトータル件数", "model", "onDeriveトータル件数"]
     // ここから追加処理
    ]
    // その他カスタムイベントを定義する
   ,pubsubOtherEvent: [
      ["showページ情報",     "view",       "showページ情報"]
     // ここから追加処理
    ]
    // -----------------------------------------------------------------------------------------------
    // 画面が表示された時、最初にフォーカスを設定する項目を指定する
    // -----------------------------------------------------------------------------------------------
    , firstFocusItem: [
      // ここから追加処理
    ]
    // -----------------------------------------------------------------------------------------------
    // F12押下時、フォーカスを設定する項目を指定する
    // -----------------------------------------------------------------------------------------------
    , f12FocusItem: [
      // ここから追加処理
    ]
    // ----------------------------------------------------------------------------------
    // 画面ヘッダ  キー定義
    // （自画面のセッションストレージに設定される）
    // ----------------------------------------------------------------------------------
    ,sessionStorageHeaderKey: [
    ]
    // ----------------------------------------------------------------------------------
    // 画面明細  キー定義
    // テーブル明細行をクリックしたときに設定するキー項目名を指定する
    // （本画面は照会専用で遷移先を持たないため定義しない）
    // ----------------------------------------------------------------------------------
   ,sessionStorageDetailKey: [
    ]
    // ----------------------------------------------------------------------------------
    // 画面フッター  キー定義
    // （自画面のセッションストレージに設定される）
    // ----------------------------------------------------------------------------------
   ,sessionStorageFooterKey: [
      {
         datasetid: "header"
        ,dataname: ["カレントページ", "ページライン数"]
        ,typename: ["dataset",        "dataset"]
      }
    ]
    // ----------------------------------------------------------------------------------
    // 次画面への引き継ぎデータ定義
    // ----------------------------------------------------------------------------------
   ,nextStorageData: [
    ]
    // ----------------------------------------------------------------------------------
    // 前画面からの引き継ぎデータ定義
    // ----------------------------------------------------------------------------------
   ,beforeStorageData: [
    ]
    // ----------------------------------------------------------------------------------
    // 選択画面への引き渡しデータ定義
    // ----------------------------------------------------------------------------------
   ,selectStorageRequestData: [
    ]
    // ----------------------------------------------------------------------------------
    // 選択画面からの引き渡しデータ定義
    // ----------------------------------------------------------------------------------
   ,selectStorageResponseData: [
    ]
    // -----------------------------------------------------------------------------------------------
    // セレクトボックス定義
    // -----------------------------------------------------------------------------------------------
   , selectbox: [
    ]
    // -----------------------------------------------------------------------------------------------
    // 明細行削除チェックボックス定義
    // -----------------------------------------------------------------------------------------------
   , checkboxDetail: [
    ]

  });
  App.AppSpec = AppSpec;

}(jQuery, Halu));
